Repository: alex1ozr/TelegramBot
Catalog: src/Application/Resources/BotMessages.*.resx
Languages: ru

# HelpCommand
source: <b>Welcome to SWeather bot (beta)!</b> Stay updated on space weather with our bot. Here’s how you can get started: <b>Commands:</b> - <b>/ovation_prime</b>: Forecast & Nowcast by Ovation Prime. - <b>/discussions</b>: Get the latest space weather forecasts and discussions. - <b>/set_language</b>: Set your preferred language for the bot. - <b>/policy</b>: View our privacy policy. - <b>/donate</b>: Support the bot’s development by donating Telegram stars. - <b>/help</b>: See this list of commands and learn how to use the bot. <b>Connect with Us:</b> - <b>Telegram Channel</b>: <a href="https://t.me/aurorasciencehub">Aurora Science Hub</a> - <b>Telegram Chat</b>: <a href="https://t.me/+DBxLzqrDX0UxNTQy">Join the Conversation</a> - <b>Email</b>: <a href="mailto:contact@aurorasciencehub.com">contact@aurorasciencehub.com</a> Thank you for using SWeather bot! If you have any questions or need assistance, feel free to reach out.
ru: <b>Добро пожаловать в Weather bot!</b> Будьте в курсе космической погоды с нашим ботом. <b>Команды:</b> - <b>/ovation_prime</b>: Прогноз и мониторинг сияний (Ovation Prime) - <b>/discussions</b>: Получить последние прогнозы и обсуждения космической погоды. - <b>/set_language</b>: Установить предпочитаемый язык для бота. - <b>/policy</b>: Ознакомиться с политикой конфиденциальности. - <b>/donate</b>: Поддержать развитие бота, пожертвовав Telegram звёзды. - <b>/help</b>: Посмотреть этот список команд и узнать, как пользоваться ботом. <b>Связь с нами:</b> ^_^ Спасибо за использование Weather bot! Если у Вас есть вопросы или нужна помощь, не стесняйтесь обращаться к нам.

# UnknownCommand
source: Unrecognized command :(
ru: Неизвестная команда

# NoDataAvailable
source: No data available at this moment
ru: Нет данных на текущий момент

# NoaaForecastDiscussion
source: NOAA 1-day forecast ({0} UTC): {1} Source: {2}
ru: Обзор NOAA на 1 день ({0} UTC): {1} Источник: {2}

# DonateCommand
source: Please select the option for your donate.
ru: Пожалуйста, выберите опцию для пожертвования.

# DonationInvoiceDescription
source: Your donation will help the service become better!
ru: Ваше пожертвование поможет сервису стать еще лучше!

# CannotCreateInvoiceError
source: Couldn't create Invoice.
ru: Не удалось выставить счёт.

source: Donation
ru: Пожертвование

# DonationDescription
source: Donation of {0} {1}
ru: Пожертвование {0} {1}

# ThanksForSupportMessage
source: Thank you for your support!
ru: Спасибо за вашу поддержку!

# SuccessfulRefundMessage
source: Refund was successful.
ru: Возврат средств был успешно проведён.

# DiscussionsCommand
source: Please select the option
ru: Пожалуйста, выберите опцию

# SidcForecastDiscussion
source: SIDC Presto Alert ({0} UTC): {1} Source: {2}
ru: Обзор SIDC Presto ({0} UTC): {1} Источник: {2}

# NoaaForecast27Discussion
source: NOAA 27-days forecast ({0} UTC): {1} Source: {2}
ru: Обзор NOAA на 27 дней ({0} UTC): {1} Источник: {2}

# DiscussionCommandDescription
source: Space weather forecasts and discussions
ru: Обзоры и прогнозы космической погоды

# IpgForecastDiscussion
source: IPG 1-day forecast ({0} UTC): {1} Source: {2}
ru: Обзор ФГБУ "ИПГ" на 1 день ({0} UTC): {1} Источник: {2}

# SetUserLanguageCommand
source: Please select the language
ru: Пожалуйста, выберите язык

# UserLanguageWasSetIntoAuto
source: Language was set to Auto
ru: Был установлен автоматический выбор языка интерфейса

# HelpCommandDescription
source: The list of available commands and instructions on how to use the bot.
ru: Список доступных команд и инструкции по использованию бота.

# PrivacyPolicy
source: *Privacy Policy for SWeather\.Bot* Welcome to SWeather\.Bot\! We value your privacy and are committed to protecting your personal data\. This privacy policy explains how we collect, use, and protect your data in compliance with the General Data Protection Regulation \(GDPR\)\. *1\. Information We Collect* \- *User Information*: We collect your Telegram user ID, username, and language preference to personalize your experience\. \- *Bot Usage Data*: We track your interactions with the bot, such as commands executed, to improve our services\. *2\. Legal Basis for Processing* \- *Performance of a Contract*: We process your data to provide the services offered by the bot\. \- *Legitimate Interests*: We use your data to enhance and secure our services\. \- *Consent*: Where applicable, we may request your consent for certain types of data processing\. *3\. How We Use Your Information* \- *Personalization*: To customize content in your preferred language\. \- *Service Improvement*: To analyze bot usage and improve functionality\. \- *Communication*: To inform you of updates or important information related to the bot\. *4\. Data Sharing* We *do not* sell, share, or distribute your personal data to third parties, except as required by law\. *5\. Data Retention* We retain your data only for as long as necessary to fulfill the purposes outlined in this policy or as required by law\. If you request deletion, we will promptly erase your data unless we are legally obliged to retain it\. *6\. Your Rights Under GDPR* You have the following rights concerning your personal data: \- *Right of Access*: You can request access to your personal data\. \- *Right to Rectification*: You can request corrections to your data if it is inaccurate or incomplete\. \- *Right to Erasure*: You can request the deletion of your data \("right to be forgotten"\)\. \- *Right to Restrict Processing*: You can request that we limit the processing of your data\. \- *Right to Data Portability*: You can request a copy of your data in a machine\-readable format\. \- *Right to Object*: You can object to the processing of your data based on legitimate interests\. \- *Right to Withdraw Consent*: If processing is based on consent, you can withdraw it at any time\. *7\. International Data Transfers* If we transfer your data outside the European Economic Area \(EEA\), we ensure it is protected by appropriate safeguards, such as standard contractual clauses approved by the European Commission\. *8\. Data Security* We employ appropriate technical and organizational measures to protect your data against unauthorized access, loss, or disclosure\. However, please note that no internet transmission is entirely secure\. *9\. Changes to This Policy* We may update this privacy policy from time to time\. Significant changes will be communicated through the bot or other appropriate means\. *10\. Contact Us* For any questions, concerns, or requests regarding your data or this privacy policy, please contact our Data Protection Officer at contact@aurorasciencehub\.com\. Thank you for trusting SWeather\.Bot\!
ru: *Политика конфиденциальности для Weather\.Bot* Добро пожаловать в Weather\.Bot\! Мы ценим вашу конфиденциальность и обязуемся защищать ваши личные данные\. Эта политика конфиденциальности объясняет, как мы собираем, используем и защищаем ваши данные в соответствии с Общим положением о защите данных \(GDPR\)\. *1\. Собираемая нами информация* \- *Информация о пользователе*: Мы собираем ваш идентификатор пользователя Telegram, имя пользователя и языковые предпочтения, чтобы персонализировать ваш опыт\. \- *Данные об использовании бота*: Мы отслеживаем ваше взаимодействие с ботом, например, выполняемые команды, чтобы улучшить наши услуги\. *2\. Правовое основание для обработки* \- *Исполнение договора*: Мы обрабатываем ваши данные для предоставления услуг, предлагаемых ботом\. \- *Легитимные интересы*: Мы используем ваши данные для улучшения и обеспечения безопасности наших услуг\. \- *Согласие*: В соответствующих случаях мы можем запросить ваше согласие на обработку определенных типов данных\. *3\. Как мы используем вашу информацию* \- *Персонализация*: Для настройки контента на предпочитаемом вами языке\. \- *Улучшение сервиса*: Для анализа использования ботов и улучшения функциональности\. \- *Коммуникация*: Чтобы информировать вас об обновлениях или важной информации, связанной с ботом\. *4\. Обмен данными* Мы *не* продаем, не передаем и не распространяем ваши личные данные третьим лицам, за исключением случаев, предусмотренных законом\. *5\. Хранение данных* Мы храним ваши данные только до тех пор, пока это необходимо для выполнения целей, изложенных в настоящей политике, или в соответствии с требованиями закона\. Если вы потребуете удаления, мы незамедлительно удалим ваши данные, за исключением случаев, когда мы обязаны хранить их по закону\. *6\. Ваши права в соответствии с GDPR* У вас есть следующие права в отношении ваших персональных данных: \- *Право доступа*: Вы можете запросить доступ к своим персональным данным\. \- *Право на исправление*: Вы можете запросить исправление своих данных, если они являются неточными или неполными\. \- *Право на удаление*: Вы можете запросить удаление своих данных \(«право быть забытым»\)\. \- *Право на ограничение обработки*: Вы можете потребовать, чтобы мы ограничили обработку ваших данных\. \- *Право на переносимость данных*: Вы можете запросить копию своих данных в машиночитаемом формате\. \- *Право на возражение*: Вы можете возражать против обработки ваших данных на основании законных интересов\. \- *Право на отзыв согласия*: Если обработка основана на согласии, вы можете отозвать его в любое время\. *7\. Международная передача данных*\. Если мы передаем ваши данные за пределы Европейской экономической зоны \(ЕЭЗ\), мы обеспечиваем их защиту с помощью соответствующих мер предосторожности, таких как стандартные договорные положения, одобренные Европейской комиссией\. *8\. Безопасность данных* Мы используем соответствующие технические и организационные меры для защиты ваших данных от несанкционированного доступа, потери или раскрытия\. Однако, пожалуйста, обратите внимание, что ни одна передача данных через Интернет не является полностью безопасной\. *9\. Изменения в данной политике* Мы можем время от времени обновлять эту политику конфиденциальности\. О существенных изменениях мы будем сообщать через бот или другими соответствующими способами\. *10\. Связаться с нами* По всем вопросам, проблемам или запросам, касающимся ваших данных или данной политики конфиденциальности, обращайтесь к нашему специалисту по защите данных по адресу contact@xxx\.xxx\. Спасибо, что доверяете Weather\.Bot\!

# OvationPrimeCommand
source: Please select the option
ru: Пожалуйста, выберите опцию

# OvationPrimeNoaaForecast1H
source: 1-hour forecast
ru: Прогноз на 1ч

# OvationPrimeNoaaForecast1HCaption
source: 1-hour forecast for {0} MSK ({1} UTC)
ru: Прогноз на 1ч {0} МСК ({1} UTC)

# OvationPrimeNoaaNowcast
source: Aurora now
ru: Сияние сейчас

# OvationPrimeNoaaNowcastCaption
source: Aurora now
ru: Сияние сейчас

# OvationPrimeCommandDescription
source: Forecast & Nowcast by Ovation Prime
ru: Прогноз и мониторинг сияний (Ovation Prime)

# CommandNotAllowedInGroups
source: Command /{0} is not available in group chats
ru: Команда /{0} недоступна в групповых чатах

# BotStatistics
source: <b>Bot statistics for {0}</b> <b>Top commands:</b> {1} Total: {2} <b>Top users:</b> {3} <b>New users (+{4}, total: {5}):</b> {6}
ru: <b>Статистика бота за {0}</b> <b>Топ команд:</b> {1} Всего: {2} <b>Топ пользователей:</b> {3} <b>Новые пользователи (+{4}, всего: {5}):</b> {6}
